import { Injectable } from '@angular/core';
import { InMemoryDbService } from 'angular-in-memory-web-api';

import { IVehicle } from '../interfaces';

@Injectable({
  providedIn: 'root',
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const vehicles: IVehicle[] = [
      {
        id: 1,
        name: 'Автобусы',
        routes: [
          {
            id: 1,
            name: '19',
            stops: [
              {
                id: 1,
                name: 'ДС Карастояновой',
                coordinate: [53.9400966, 27.564839024]
              },
              {
                id: 2,
                name: 'Карастояновой',
                coordinate: [53.938490013, 27.565802682]
              },
              {
                id: 3,
                name: 'Орловская',
                coordinate: [53.933725015, 27.565689682]
              },
              {
                id: 4,
                name: 'Кульман',
                coordinate: [53.92767686, 27.566653156]
              },
              {
                id: 5,
                name: 'Парк Дружбы Народов',
                coordinate: [53.925690049, 27.570926785]
              },
              {
                id: 6,
                name: 'Максима Богдановича',
                coordinate: [53.92092502, 27.568691682]
              },
              {
                id: 7,
                name: 'Комаровский рынок',
                coordinate: [53.919049119, 27.575927149]
              },
              {
                id: 8,
                name: 'Станция метро Площадь Якуба Коласа',
                coordinate: [53.916316567, 27.581091792]
              },
              {
                id: 9,
                name: 'Красная',
                coordinate: [53.912994742, 27.574949397]
              },
              {
                id: 10,
                name: 'Проспект Независимости',
                coordinate: [53.910148024, 27.578274682]
              },
              {
                id: 11,
                name: 'Берестянская',
                coordinate: [53.906848013, 27.588117499]
              },
              {
                id: 12,
                name: 'Платонова',
                coordinate: [53.905706909, 27.591880432]
              },
              {
                id: 13,
                name: 'Гипсовый завод',
                coordinate: [53.903894969, 27.597502358]
              },
              {
                id: 14,
                name: 'Переулок Козлова',
                coordinate: [53.900942273, 27.602004113]
              },
              {
                id: 15,
                name: 'Уральская',
                coordinate: [53.898637029, 27.607076682]
              },
              {
                id: 16,
                name: 'Фроликова',
                coordinate: [53.901217933, 27.613634521]
              },
              {
                id: 17,
                name: 'Менделеева',
                coordinate: [53.902446178, 27.618903854]
              },
              {
                id: 18,
                name: 'Бумажкова',
                coordinate: [53.902601405, 27.624195853]
              },
              {
                id: 19,
                name: 'Аннаева',
                coordinate: [53.904052866, 27.628153449]
              },
              {
                id: 20,
                name: 'Запорожская площадь',
                coordinate: [53.905021996, 27.632943241]
              },
              {
                id: 21,
                name: 'Слепянка',
                coordinate: [53.906888026, 27.636907682]
              }
            ]
          },
          {
            id: 2,
            name: '106',
            stops: [
              {
                id: 22,
                name: 'ДС Ангарская-4',
                coordinate: [53.886884583, 27.689237356]
              },
              {
                id: 23,
                name: 'Нестерова',
                coordinate: [53.884275917, 27.683926977]
              },
              {
                id: 24,
                name: 'Ангарская-3',
                coordinate: [53.882518809, 27.680000993]
              },
              {
                id: 25,
                name: '2-й Енисейский переулок',
                coordinate: [53.879927254, 27.67261472]
              },
              {
                id: 26,
                name: 'Алтайская-1',
                coordinate: [53.877789568, 27.667330089]
              },
              {
                id: 27,
                name: 'Алтайская-2',
                coordinate: [53.881564036, 27.662406682]
              },
              {
                id: 28,
                name: 'Троллейбусный парк № 5',
                coordinate: [53.892173247, 27.655499882]
              },
              {
                id: 29,
                name: 'Профтехколледж',
                coordinate: [53.89683803, 27.649513682]
              },
              {
                id: 30,
                name: 'Круглая площадь',
                coordinate: [53.893776042, 27.642158586]
              },
              {
                id: 31,
                name: 'Ваупшасова',
                coordinate: [53.888389686, 27.629232885]
              },
              {
                id: 32,
                name: 'Будённого',
                coordinate: [53.886038266, 27.619316787]
              },
              {
                id: 33,
                name: 'Станция метро Тракторный Завод',
                coordinate: [53.88895057, 27.616149573]
              }
            ]
          }
        ]
      },
      {
        id: 2,
        name: 'Трамваи',
        routes: [
          {
            id: 3,
            name: '4',
            stops: [
              {
                id: 34,
                name: 'Площадь Мясникова',
                coordinate: [53.892548746, 27.542639403]
              },
              {
                id: 35,
                name: 'Ленинградская',
                coordinate: [53.892004983, 27.546335226]
              },
              {
                id: 36,
                name: 'Свердлова',
                coordinate: [53.892511059, 27.557184358]
              },
              {
                id: 37,
                name: 'Стадион Динамо',
                coordinate: [53.894191533, 27.562013146]
              },
              {
                id: 38,
                name: 'Лицей БГУ',
                coordinate: [53.896325443, 27.567041986]
              },
              {
                id: 39,
                name: 'Парк Горького',
                coordinate: [53.899946596, 27.57360242]
              },
              {
                id: 40,
                name: 'Захарова',
                coordinate: [53.903253331, 27.58135179]
              },
              {
                id: 41,
                name: 'Змитрока Бядули',
                coordinate: [53.907404707, 27.583035928]
              },
              {
                id: 42,
                name: 'Проспект Независимости',
                coordinate: [53.910266935, 27.57859203]
              },
              {
                id: 43,
                name: 'Красная',
                coordinate: [53.912950792, 27.575378371]
              },
              {
                id: 44,
                name: 'Куйбышева',
                coordinate: [53.916097982, 27.570115206]
              },
              {
                id: 45,
                name: 'Максима Богдановича',
                coordinate: [53.916559944, 27.56456895]
              },
              {
                id: 46,
                name: 'Театральная',
                coordinate: [53.917375346, 27.557146058]
              },
              {
                id: 47,
                name: 'Переспа',
                coordinate: [53.920514075, 27.550315027]
              },
              {
                id: 48,
                name: 'Дворец детей и молодёжи',
                coordinate: [53.925285181, 27.545386411]
              },
              {
                id: 49,
                name: 'Веры Слуцкой',
                coordinate: [53.930195619, 27.543663412]
              },
              {
                id: 50,
                name: 'ДС Озеро',
                coordinate: [53.932966948, 27.54181274]
              }
            ]
          }
        ]
      }
    ];
    return {vehicles};
  }
}
